# GetCompUseClassLPCl

## Description
Gets the use class pen colors for left pen flag of a component in an object.

```pascal
FUNCTION GetCompUseClassLPCl(
				object                          : HANDLE;
				componentIndex                  : INTEGER;
				VAR useClassPenColorsForLeftPen : BOOLEAN): BOOLEAN;
```

```python
def vs.GetCompUseClassLPCl(object, componentIndex):
    return (BOOLEAN, useClassPenColorsForLeftPen)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|object|HANDLE|The object. Can be a wall, round wall, slab, roof face, roof, Wall Style, Slab Style, Roof Style, the Wall Preferences, the Slab Preferences, or the Roof Preferences.|
|componentIndex|INTEGER|The index of the component.|
|useClassPenColorsForLeftPen|BOOLEAN|Returns whether or not the component is using class attributes for its left pen colors.|

## Examples
```pascal
resultOK := GetCompUseClassLPCl(object, 1, TRUE);
```
```python
import vs

# Gets the use class pen colors for left pen flag of a component in an object.
object = vs.FSActLayer()  # handle to the first selected object on the active layer
componentIndex = 1

ok, useClassPenColorsForLeftPen = vs.GetCompUseClassLPCl(object, componentIndex)
vs.Message('GetCompUseClassLPCl returned: ' + str((ok, useClassPenColorsForLeftPen)))
```

## See Also
VS Functions:
SetCompUseClassLPCl

## Version
Availability: from Vectorworks 2016

## Category
* Objects - Architectural